---
kind: method
id: M:Autodesk.Revit.DB.ThermalAsset.Dispose
source: html/6a579a44-9d7c-1748-16e2-a95fa7979eac.htm
---
# Autodesk.Revit.DB.ThermalAsset.Dispose Method

Releases all resources used by the ThermalAsset

## Syntax (C#)
```csharp
public void Dispose()
```